<?php
	include($_SERVER['DOCUMENT_ROOT'].'/intrade/Home.php');

$link = mysqli_connect('localhost','admin','admin');

$db = "Shop";



function search ($query){ // =================================================================> Обработка поискового запроса
$text = ''; // ===============================================================================> Переменная для вывода текста
// ============================================================================================>  Проводим фильтрацию данных
$query = trim($query); // ==================================================================>  Обрезаем пробелы и спецсиволы
$query = strip_tags($query); // ==================================================================>  Удаляем HTML и PHP теги
$query = mysql_real_escape_string($query); // =============================================>  Экранируем специальные символы
if(!empty($query)){ // ====================================================================> Если поисковый запрос не пустой
  if(strlen($query) < 4){ // ================================================================> Если запрос меньше 4 символов
    $text = '<p>короткий поисковый запрос.</p>';} // ==================================================> Сообщение об ошибке
  else if(strlen($query) > 128){ // ===============================================================> Если более 128 символов
    $text = '<p>длинный поисковый запрос.</p>';} // ===================================================> Сообщение об ошибке
  else{ // =================================================================================================> Если всё верно
    $sql = "SELECT * FROM article WHERE h LIKE '%$query%' OR p LIKE '%$query%'"; // ===> Формируем строку поискового запроса
    $result = mysql_query($sql); // =======================================================================> И выполняем его
    $num = mysql_num_rows($result); // =========================================> Определим колличество найденных совпадений
    if($num > 0){ // =================================================================================> Если совпадения есть
      $row = mysql_fetch_assoc($result); // =================================================> Получаем ассоциативный массив
      $text .= '<p>По вашему запросу  <strong>'.$query.'</strong>'; // =====> И начинаем формировать строку поисковой выдачи
      $text .= ' найдено '.$num.' совпадений</p>' ; // ===================================> Показываем количество совпадениц
      // ===================================================================================================================
      do { // ==========================================================================> Динамический вывод всех совпадений
        $text .= '<h3>'.$row['h'].'</h3>';
        $text .= '<p>'.nl2br($row['p']).'</p>';}
      while($row = mysql_fetch_assoc($result));} // =================================> Делаем это пока у нас есть результаты
    else{ // =============================================================================> Если найти совпадение не удалось
      $text = '<p>По вашему запросу ничего не найдено.</p>';}}} // ====================================> Сообщение о неудаче
  else{ // =========================================================================================> Если запрос был пустой
    $text = '<p>Задан пустой поисковый запрос.</p>';} // ==============================================> Сообщение об ошибке
return $text;} // =======================================================> Возвращаем сформированную строку поисковой выдачи
// =========================================================================================================================
// ==================================================================================================> Сам скрипт обработчик
if(isset($_POST['query'])){ // ===========================================================================> Если есть запрос
  $connect = connectDB(); // ==========================================================> Открываем соединение с базой данных
  $search_result = search($_POST['query']); // ================================================> Определяем поисковый запрос 
  echo $search_result; // =========================================================================================> Выводим
  closeDB ($connect);} 
  ?>